#### Input and output typically falls into a few main categories: reading text files and other more efficient on-disk formats, loading data from databases, and interacting with network sources like web APIs.

#### read_csv is very versatile which allows *type inference* which means the type of the columns needs not be defined instead it is automatically detected by read_csv.

In [3]:
!cat examples.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
import pandas as pd

In [6]:
df = pd.read_csv('examples.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### JSON (JavaScript Object Notation)

JSON has become one of the standard formats for sending data by HTTP request between web browsers and other applications. It is a much more free-form data format than a tabular text form like CSV. All the keys in a JSON object (dict) should be strings. There are several Python libraries for reading and writing JSON data. Python has json library in its standard library to deal with JSON data.

In [8]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [10]:
import json

result  = json.loads(obj)  ## json.loads converts JSON file into Python format


result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

#### json.dumps, on the other hand, converts a Python object back to JSON.

In [11]:
pytojson = json.dumps(result)
pytojson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

There are many ways to convert json read file in to DataFrames.

In [14]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'], index=['elder', 'younger'])
siblings

          name  age
elder    Scott   30
younger  Katie   38

In [18]:
df = pd.read_json('example.json')

df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## Web Scraping (HTML and XML)


Python has many libraries for reading and writing data in the ubiquitous HTML and XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is comparatively much faster in general, the other libraries can better handle malformed HTML or XML files.

In [23]:
tables = pd.read_csv('banklist.csv')

tables.head()

,"Inter Savings Bank, fsb D/B/A InterBank, fsb",City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,1-Nov-19,7-Nov-19
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,25-Oct-19,12-Nov-19
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,25-Oct-19,7-Nov-19
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.",31-May-19,22-Aug-19
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,15-Dec-17,24-Jul-19

In [27]:
import requests

In [28]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'

In [31]:
resp = requests.get(url)

### Interacting with Databases

In [33]:
import sqlite3

### Creating a SQL Table

In [35]:
query = """
   CREATE TABLE test
   (a VARCHAR(20), b VARCHAR(20),
   c REAL,        d INTEGER
   );"""

In [38]:
con = sqlite3.connect('mydata.sqlite')

con.execute(query)

OperationalError: table test already exists

In [39]:
con.commit()

### Inserting a new row

In [40]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [41]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [42]:
con.executemany(stmt, data)

In [43]:
con.commit()

In [45]:
cursor = con.execute('select * from test')

In [46]:
rows = cursor.fetchall()

In [47]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [49]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

pandas has a read_sql function that enables us to read data easily from a general SQLAlchemy connection. Here, we’ll connect to the same SQLite database with SQLAlchemy and read data from the table created before.

In [51]:
import sqlalchemy as sqla

In [ ]:
db = sqla.create_engine('sqlite:///mydata.sqlite')